In [4]:
# import the pandas library as "pd"

import pandas as pd

In [3]:
# read the titanic.csv file and create a dataframe from it using the appropriade method of pandas library

my_df = pd.read_csv("titanic.csv")

In [7]:
#methods - are followed by parenthesis

# Quick exploration for the dataset, .head() returns the first 5 rows by default.

my_df.head()


#discplays names of columns, the data types they contain and where the have any missing values.

homelessness.info()

# compute some summary statistics for numerical columns like mean and median
# count is the number of non-missing values in each column

homelessness.describe()

# attributes - are not followed by parenthesis

# returns a tuple that holds the number of rows followed by the number of columns.
homelessness.shape

# represent the data values in a 2-dimensional NumPy array.
homelessness.values

# represent column names in a list
homelessness.columns

# show the row numbers or row names
homelessness.index

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 0 to 50
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Unnamed: 0      51 non-null     int64
 1   region          51 non-null     object
 2   state           51 non-null     object
 3   individuals     51 non-null     float64
 4   family_members  51 non-null     float64
 5   state_pop       51 non-null     int64
dtypes: float64(2), int64(2), object(2)
memory usage: 2.5+ KB

RangeIndex(start=0, stop=51, step=1)

# Inspecting a DataFrame
When you get a new DataFrame to work with, the first thing you need to do is explore it and see what it contains. There are several useful methods and attributes for this.

- .head() returns the first few rows (the “head” of the DataFrame).
- .info() shows information on each of the columns, such as the data type and number of missing values.
- .shape returns the number of rows and columns of the DataFrame.
- .describe() calculates a few summary statistics for each column.

homelessness is a DataFrame containing estimates of homelessness in each U.S. state in 2018. The individual column is the number of homeless individuals not part of a family with children. The family_members column is the number of homeless individuals part of a family with children. The state_pop column is the state's total population

In [13]:
# Print the column index of homelessness

print (my_df.columns)

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [19]:
# Print the row index of homelessness

print (my_df.index)

RangeIndex(start=0, stop=892, step=1)

In [12]:
# Print some values of titanic dataframe

print (my_df.values)

[[0.0 3.0 'male' ... 'Southampton' 'no' False]
 [1.0 1.0 'female' ... 'Cherbourg' 'yes' False]
 [1.0 3.0 'female' ... 'Southampton' 'yes' True]
 ...
 [0.0 3.0 'female' ... 'Southampton' 'no' False]
 [1.0 1.0 'male' ... 'Cherbourg' 'yes' True]
 [0.0 3.0 'male' ... 'Queenstown' 'no' True]]

In [6]:
# Print the head of the titanic dataframe and check how many rows of this dataframe are printed

print (my_df.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0       0.0     3.0    male  22.0      1      0   7.2500        S  Third
1       1.0     1.0  female  38.0      1      0  71.2833        C  First
2       1.0     3.0  female  26.0      0      0   7.9250        S  Third
3       1.0     1.0  female  35.0      1      0  53.1000        S  First
4       0.0     3.0    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

In [9]:
# Print the first 10 rows of the titanic dataframe

print (my_df.head(10))

   survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0       0.0     3.0    male  22.0      1      0   7.2500        S   Third
1       1.0     1.0  female  38.0      1      0  71.2833        C   First
2       1.0     3.0  female  26.0      0      0   7.9250        S   Third
3       1.0     1.0  female  35.0      1      0  53.1000        S   First
4       0.0     3.0    male  35.0      0      0   8.0500        S   Third
5       0.0     3.0    male   NaN      0      0   8.4583        Q   Third
6       0.0     1.0    male  54.0      0      0  51.8625        S   First
7       0.0     3.0    male   2.0      3      1  21.0750        S   Third
8       1.0     3.0  female  27.0      0      2  11.1333        S   Third
9       1.0     2.0  female  14.0      1      0  30.0708        C  Second

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True
5    man        True  NaN   Queenstown    no    NaN
6    man        True    E  Southampton    no   True
7  child       False  NaN  Southampton    no  False
8  woman       False  NaN  Southampton   yes  False
9  child       False  NaN    Cherbourg   yes  False

In [18]:
# Print the first 22 rows of the titanic dataframe

print (my_df.head(22))

    survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0        0.0     3.0    male  22.0      1      0   7.2500        S   Third
1        1.0     1.0  female  38.0      1      0  71.2833        C   First
2        1.0     3.0  female  26.0      0      0   7.9250        S   Third
3        1.0     1.0  female  35.0      1      0  53.1000        S   First
4        0.0     3.0    male  35.0      0      0   8.0500        S   Third
5        0.0     3.0    male   NaN      0      0   8.4583        Q   Third
6        0.0     1.0    male  54.0      0      0  51.8625        S   First
7        0.0     3.0    male   2.0      3      1  21.0750        S   Third
8        1.0     3.0  female  27.0      0      2  11.1333        S   Third
9        1.0     2.0  female  14.0      1      0  30.0708        C  Second
10       1.0     3.0  female   4.0      1      1  16.7000        S   Third
11       1.0     1.0  female  58.0      0      0      NaN        S   First
12       0.0     3.0    male  20.0      0      0   8.0500        S   Third
13       0.0     3.0    male  39.0      1      5  31.2750        S   Third
14       0.0     3.0  female  14.0      0      0   7.8542        S   Third
15       1.0     2.0  female  55.0      0      0  16.0000        S  Second
16       0.0     3.0    male   2.0      4      1  29.1250        Q   Third
17       1.0     2.0    male   NaN      0      0  13.0000        S  Second
18       0.0     3.0  female  31.0      1      0  18.0000        S   Third
19       1.0     3.0  female   NaN      0      0   7.2250        C   Third
20       0.0     2.0    male  35.0      0      0  26.0000        S  Second
21       1.0     2.0    male  34.0      0      0  13.0000        S  Second

      who  adult_male deck  embark_town alive  alone
0     man        True  NaN  Southampton    no  False
1   woman       False    C    Cherbourg   yes  False
2   woman       False  NaN  Southampton   yes   True
3   woman       False    C  Southampton   yes  False
4     man        True  NaN  Southampton    no   True
5     man        True  NaN   Queenstown    no    NaN
6     man        True    E  Southampton    no   True
7   child       False  NaN  Southampton    no  False
8   woman       False  NaN  Southampton   yes  False
9   child       False  NaN    Cherbourg   yes  False
10  child       False    G  Southampton   yes  False
11  woman       False    C  Southampton   yes   True
12    man        True  NaN  Southampton    no   True
13    man        True  NaN  Southampton    no  False
14  child       False  NaN  Southampton    no   True
15  woman       False  NaN  Southampton   yes   True
16  child       False  NaN   Queenstown    no  False
17    man        True  NaN  Southampton   yes   True
18  woman       False  NaN  Southampton    no  False
19  woman       False  NaN    Cherbourg   yes   True
20    man        True  NaN  Southampton    no   True
21    man        True    D  Southampton   yes   True

In [15]:
# Print the last 5 rows of the titanic dataframe

print (my_df.tail())

     survived  pclass     sex   age  sibsp  parch   fare embarked   class  \
887       0.0     2.0    male  27.0      0      0  13.00        S  Second
888       1.0     1.0  female  19.0      0      0  30.00        S   First
889       0.0     3.0  female   NaN      1      2  23.45        S   Third
890       1.0     1.0    male  26.0      0      0  30.00        C   First
891       0.0     3.0    male  32.0      0      0   7.75        Q   Third

       who  adult_male deck  embark_town alive  alone
887    man        True  NaN  Southampton    no   True
888  woman       False    B  Southampton   yes   True
889  woman       False  NaN  Southampton    no  False
890    man        True    C    Cherbourg   yes   True
891    man        True  NaN   Queenstown    no   True

In [16]:
# Print the last 10 rows of the titanic dataframe

print (my_df.tail(10))

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
882       0.0     3.0    male  33.0      0      0   7.8958        S   Third
883       0.0     3.0  female  22.0      0      0  10.5167        S   Third
884       0.0     2.0    male  28.0      0      0  10.5000        S  Second
885       0.0     3.0    male  25.0      0      0   7.0500        S   Third
886       0.0     3.0  female  39.0      0      5  29.1250        Q   Third
887       0.0     2.0    male  27.0      0      0  13.0000        S  Second
888       1.0     1.0  female  19.0      0      0  30.0000        S   First
889       0.0     3.0  female   NaN      1      2  23.4500        S   Third
890       1.0     1.0    male  26.0      0      0  30.0000        C   First
891       0.0     3.0    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
882    man        True  NaN  Southampton    no   True
883  woman       False  NaN  Southampton    no   True
884    man        True  NaN  Southampton    no   True
885    man        True  NaN  Southampton    no   True
886  woman       False  NaN   Queenstown    no  False
887    man        True  NaN  Southampton    no   True
888  woman       False    B  Southampton   yes   True
889  woman       False  NaN  Southampton    no  False
890    man        True    C    Cherbourg   yes   True
891    man        True  NaN   Queenstown    no   True

In [17]:
# Print the last 22 rows of the titanic dataframe

print (my_df.tail(22))

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
870       1.0     3.0    male   4.0      1      1  11.1333        S   Third
871       0.0     3.0    male  26.0      0      0   7.8958        S   Third
872       1.0     1.0  female  47.0      1      1  52.5542        S   First
873       0.0     1.0    male  33.0      0      0   5.0000        S   First
874       0.0     3.0    male  47.0      0      0   9.0000        S   Third
875       1.0     2.0  female  28.0      1      0  24.0000        C  Second
876       1.0     3.0  female  15.0      0      0   7.2250        C   Third
877       0.0     3.0    male  20.0      0      0   9.8458        S   Third
878       0.0     3.0    male  19.0      0      0   7.8958        S   Third
879       0.0     3.0    male   NaN      0      0   7.8958        S   Third
880       1.0     1.0  female  56.0      0      1  83.1583        C   First
881       1.0     2.0  female  25.0      0      1  26.0000        S  Second
882       0.0     3.0    male  33.0      0      0   7.8958        S   Third
883       0.0     3.0  female  22.0      0      0  10.5167        S   Third
884       0.0     2.0    male  28.0      0      0  10.5000        S  Second
885       0.0     3.0    male  25.0      0      0   7.0500        S   Third
886       0.0     3.0  female  39.0      0      5  29.1250        Q   Third
887       0.0     2.0    male  27.0      0      0  13.0000        S  Second
888       1.0     1.0  female  19.0      0      0  30.0000        S   First
889       0.0     3.0  female   NaN      1      2  23.4500        S   Third
890       1.0     1.0    male  26.0      0      0  30.0000        C   First
891       0.0     3.0    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
870  child       False  NaN  Southampton   yes  False
871    man        True  NaN  Southampton    no   True
872  woman       False    D  Southampton   yes  False
873    man        True    B  Southampton    no   True
874    man        True  NaN  Southampton    no   True
875  woman       False  NaN    Cherbourg   yes  False
876  child       False  NaN    Cherbourg   yes   True
877    man        True  NaN  Southampton    no   True
878    man        True  NaN  Southampton    no   True
879    man        True  NaN  Southampton    no   True
880  woman       False    C    Cherbourg   yes  False
881  woman       False  NaN  Southampton   yes  False
882    man        True  NaN  Southampton    no   True
883  woman       False  NaN  Southampton    no   True
884    man        True  NaN  Southampton    no   True
885    man        True  NaN  Southampton    no   True
886  woman       False  NaN   Queenstown    no  False
887    man        True  NaN  Southampton    no   True
888  woman       False    B  Southampton   yes   True
889  woman       False  NaN  Southampton    no  False
890    man        True    C    Cherbourg   yes   True
891    man        True  NaN   Queenstown    no   True

In [21]:
# How many Non-null values has each column and which is the Datatype for each one?

print(my_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 892 entries, 0 to 891
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    float64
 1   pclass       891 non-null    float64
 2   sex          891 non-null    object
 3   age          715 non-null    float64
 4   sibsp        892 non-null    int64
 5   parch        892 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     890 non-null    object
 8   class        892 non-null    object
 9   who          892 non-null    object
 10  adult_male   892 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        892 non-null    object
 14  alone        891 non-null    object
dtypes: bool(1), float64(4), int64(2), object(8)
memory usage: 98.6+ KB
None

In [8]:
# How many rows and columns has the titanic dataframe?

print(my_df.shape)

(892, 15)

In [11]:
# compute some summary statistics(mean, standard deviation, min-max values) and the number of non-missing values in each column

print(my_df.describe())

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  715.000000  892.000000  892.000000  891.000000
mean     0.383838    2.309764   29.700937    0.522422    0.381166   32.183136
std      0.486592    0.834983   14.516403    1.102264    0.805706   49.699809
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.250000    0.000000    0.000000    7.895800
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

# Sorting and subsetting

In [22]:
# Print the head of the titanic dataframe in a dataframe format

my_df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0.0,3.0,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1.0,1.0,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1.0,3.0,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1.0,1.0,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0.0,3.0,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

### Sorting

In [25]:
# sort my_df on the 'class' column in ascending order

my_df.sort_values("class")

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
445,1.0,1.0,male,4.0,0,2,81.8583,S,First,child,False,A,Southampton,yes,False
779,1.0,1.0,female,43.0,0,1,211.3375,S,First,woman,False,B,Southampton,yes,False
177,0.0,1.0,female,50.0,0,0,28.7125,C,First,woman,False,C,Cherbourg,no,True
660,1.0,1.0,male,50.0,2,0,133.6500,S,First,man,True,NaN,Southampton,yes,False
662,0.0,1.0,male,47.0,0,0,25.5875,S,First,man,True,E,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
379,0.0,3.0,male,19.0,0,0,7.7750,S,Third,man,True,NaN,Southampton,no,True
381,1.0,3.0,female,1.0,0,2,15.7417,C,Third,child,False,NaN,Cherbourg,yes,False
382,0.0,3.0,male,32.0,0,0,7.9250,S,Third,man,True,NaN,Southampton,no,True
371,0.0,3.0,male,18.0,1,0,6.4958,S,Third,man,True,NaN,Southampton,no,False
891,0.0,3.0,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [26]:
# sort my_df on the 'class' column in descending order

my_df.sort_values("class", ascending=False)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0.0,3.0,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
514,0.0,3.0,male,24.0,0,0,7.4958,S,Third,man,True,NaN,Southampton,no,True
501,0.0,3.0,female,21.0,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,no,True
502,0.0,3.0,female,NaN,0,0,7.6292,Q,Third,woman,False,NaN,Queenstown,no,True
503,0.0,3.0,female,37.0,0,0,9.5875,S,Third,woman,False,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
712,1.0,1.0,male,48.0,1,0,52.0000,S,First,man,True,C,Southampton,yes,False
102,0.0,1.0,male,21.0,0,1,77.2875,S,First,man,True,D,Southampton,no,False
467,0.0,1.0,male,56.0,0,0,26.5500,S,First,man,True,NaN,Southampton,no,True
716,1.0,1.0,female,38.0,0,0,227.5250,C,First,woman,False,C,Cherbourg,yes,True
602,0.0,1.0,male,NaN,0,0,42.4000,S,First,man,True,NaN,Southampton,no,True

In [27]:
# sort my_df on the 'class' column and on the 'embark_town' column

my_df.sort_values(["class", "embark_town"])

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1.0,1.0,female,38.00,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
30,0.0,1.0,male,40.00,0,0,27.7208,C,First,man,True,NaN,Cherbourg,no,True
31,1.0,1.0,female,NaN,1,0,146.5208,C,First,woman,False,B,Cherbourg,yes,False
34,0.0,1.0,male,28.00,1,0,82.1708,C,First,man,True,NaN,Cherbourg,no,False
52,1.0,1.0,female,49.00,1,0,76.7292,C,First,woman,False,D,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
882,0.0,3.0,male,33.00,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
883,0.0,3.0,female,22.00,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
885,0.0,3.0,male,25.00,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
889,0.0,3.0,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
804,1.0,3.0,male,0.42,0,1,8.5167,C,Third,child,False,NaN,NaN,yes,False

In [28]:
# sort my_df on the 'class' column in descending order and on the 'embark_town' column in ascending order

my_df.sort_values(["class", "embark_town"], ascending=[False,True])

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
19,1.0,3.0,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True
26,0.0,3.0,male,NaN,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True
36,1.0,3.0,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,yes,True
39,1.0,3.0,female,14.0,1,0,11.2417,C,Third,child,False,NaN,Cherbourg,yes,False
42,0.0,3.0,male,NaN,0,0,7.8958,C,Third,man,True,NaN,Cherbourg,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
872,1.0,1.0,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
873,0.0,1.0,male,33.0,0,0,5.0000,S,First,man,True,B,Southampton,no,True
888,1.0,1.0,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
61,1.0,1.0,female,38.0,0,0,80.0000,NaN,First,woman,False,B,NaN,yes,True
830,1.0,1.0,female,62.0,0,0,80.0000,NaN,First,woman,False,B,NaN,yes,True

In [28]:
# sort my_df on the 'class' column in descending order and on the 'embark_town' column in ascending order

my_df.sort_values(["class", "embark_town"], ascending=[False,True])

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
19,1.0,3.0,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True
26,0.0,3.0,male,NaN,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True
36,1.0,3.0,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,yes,True
39,1.0,3.0,female,14.0,1,0,11.2417,C,Third,child,False,NaN,Cherbourg,yes,False
42,0.0,3.0,male,NaN,0,0,7.8958,C,Third,man,True,NaN,Cherbourg,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
872,1.0,1.0,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
873,0.0,1.0,male,33.0,0,0,5.0000,S,First,man,True,B,Southampton,no,True
888,1.0,1.0,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
61,1.0,1.0,female,38.0,0,0,80.0000,NaN,First,woman,False,B,NaN,yes,True
830,1.0,1.0,female,62.0,0,0,80.0000,NaN,First,woman,False,B,NaN,yes,True

### Subsetting

In [33]:
# print a pandas series of True / False values based on the condition "fare" column values greater than 10

my_df["fare"] > 10

0      False
1       True
2      False
3       True
4      False
       ...
887     True
888     True
889     True
890     True
891    False
Name: fare, Length: 892, dtype: bool

In [35]:
# subset the dataframe based on the condition where "fare" value is greater than 10

my_df[my_df["fare"] > 10]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1.0,1.0,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1.0,1.0,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0.0,1.0,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0.0,3.0,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1.0,3.0,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0.0,3.0,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
887,0.0,2.0,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
888,1.0,1.0,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,0.0,3.0,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
890,1.0,1.0,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [36]:
# subset the dataframe based on the condition where "fare" value is less than 20

my_df[my_df["fare"] > 20]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1.0,1.0,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1.0,1.0,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0.0,1.0,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0.0,3.0,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
9,1.0,2.0,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
881,1.0,2.0,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
886,0.0,3.0,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
888,1.0,1.0,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,0.0,3.0,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
890,1.0,1.0,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [37]:
# subset the dataframe based on the condition where "who" column value is 'woman'

my_df[my_df["who"] == "woman"]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1.0,1.0,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1.0,3.0,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1.0,1.0,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
8,1.0,3.0,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
11,1.0,1.0,female,58.0,0,0,NaN,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
881,1.0,2.0,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
883,0.0,3.0,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
886,0.0,3.0,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
888,1.0,1.0,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,0.0,3.0,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [39]:
# subset the dataframe based on the condition where "who" column value is 'woman' or 'child' 

my_df[(my_df["who"] == "woman") | (my_df["who"] == "child")]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1.0,1.0,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1.0,3.0,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1.0,1.0,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
7,0.0,3.0,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1.0,3.0,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
881,1.0,2.0,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
883,0.0,3.0,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
886,0.0,3.0,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
888,1.0,1.0,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,0.0,3.0,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [41]:
# subset the dataframe based on the condition where "embark_town" column value is 'Southampton' and the "who" column value is 'man' 

my_df[(my_df["embark_town"] == "Southampton") & (my_df["who"] == "man")]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0.0,3.0,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
4,0.0,3.0,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
6,0.0,1.0,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
12,0.0,3.0,male,20.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
13,0.0,3.0,male,39.0,1,5,31.2750,S,Third,man,True,NaN,Southampton,no,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
879,0.0,3.0,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
882,0.0,3.0,male,33.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
884,0.0,2.0,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
885,0.0,3.0,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
887,0.0,2.0,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True

In [45]:
# subset the dataframe to show only rows where embark_town is in "Southampton" or "Cherbourg"

my_df[my_df["embark_town"].isin(["Southampton","Cherbourg"])]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0.0,3.0,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1.0,1.0,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1.0,3.0,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1.0,1.0,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0.0,3.0,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,0.0,3.0,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
887,0.0,2.0,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
888,1.0,1.0,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,0.0,3.0,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
890,1.0,1.0,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

embark_town
Cherbourg      1
Queenstown     1
Southampton    1
Name: embark_town, dtype: int64

# Aggregation exercises

In [5]:
startup_df = pd.read_csv("50_Startups.csv")

startup_df.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

In [91]:
# create a new ID column

#startup_df.columns[1] = "ID"

startup_df["ID"] = startup_df.index +1

startup_df = startup_df[["ID", "R&D Spend", "Administration", "Marketing Spend", "State", "Profit"]]

startup_df.head()

   ID  R&D Spend  Administration  Marketing Spend       State     Profit
0   1  165349.20       136897.80        471784.10    New York  192261.83
1   2  162597.70       151377.59        443898.53  California  191792.06
2   3  153441.51       101145.55        407934.54     Florida  191050.39
3   4  144372.41       118671.85        383199.62    New York  182901.99
4   5  142107.34        91391.77        366168.42     Florida  166187.94

In [92]:
# How many rows and columns has the titanic dataframe?

print(startup_df.shape)

(53, 6)

In [97]:
# As seen, there are more than 50 startups in this dataset
# obviously there cannot be 2 or more startups with the same profit, state, and Marketing Spend

# drop the duplicate rows, if any, based on these 3 aforementioned columns

startup_df = startup_df.drop_duplicates(["Profit", "Marketing Spend", "State"])

In [98]:
# Now check again the shape of the startup dataframe to be sure that there are only 50 unique startups

print(startup_df.shape)

(50, 6)

In [65]:
# create a new column "Total_Spend" which will be the sum of the R&D Spend, Administration and Marketing Spend

startup_df["Total_Spend"] = startup_df["R&D Spend"] + startup_df["Administration"] + startup_df["Marketing Spend"]

startup_df.head()

,ID,R&D Spend,Administration,Marketing Spend,State,Profit,Total_Spend
0,1,165349.20,136897.80,471784.10,New York,192261.83,774031.10
1,2,162597.70,151377.59,443898.53,California,191792.06,757873.82
2,3,153441.51,101145.55,407934.54,Florida,191050.39,662521.60
3,4,144372.41,118671.85,383199.62,New York,182901.99,646243.88
4,5,142107.34,91391.77,366168.42,Florida,166187.94,599667.53

In [66]:
# Sort the dataset by profit in ascending order

startup_df.sort_values("Profit", ascending=True)

,ID,R&D Spend,Administration,Marketing Spend,State,Profit,Total_Spend
49,50,0.00,116983.80,45173.06,California,14681.40,162156.86
48,49,542.05,51743.15,0.00,New York,35673.41,52285.20
47,48,0.00,135426.92,0.00,California,42559.73,135426.92
46,47,1315.46,115816.21,297114.46,Florida,49490.75,414246.13
45,46,1000.23,124153.04,1903.93,New York,64926.08,127057.20
44,45,22177.74,154806.14,28334.72,California,65200.33,205318.60
43,44,15505.73,127382.30,35534.17,New York,69758.98,178422.20
42,43,23640.93,96189.63,148001.11,California,71498.49,267831.67
41,42,27892.92,84710.77,164470.71,Florida,77798.83,277074.40
40,41,28754.33,118546.05,172795.67,California,78239.91,320096.05
39,40,38558.51,82982.09,174999.30,California,81005.76,296539.90
38,39,20229.59,65947.93,185265.10,New York,81229.06,271442.62
37,38,44069.95,51283.14,197029.42,California,89949.14,292382.51
36,37,28663.76,127056.21,201126.82,Florida,90708.19,356846.79
35,36,46014.02,85047.44,205517.64,New York,96479.51,336579.10
34,35,46426.07,157693.92,210797.67,California,96712.80,414917.66
33,34,55493.95,103057.49,214634.81,Florida,96778.92,373186.25
32,33,63408.86,129219.61,46085.25,California,97427.84,238713.72
31,32,61136.38,152701.92,88218.23,New York,97483.56,302056.53
30,31,61994.48,115641.28,91131.24,Florida,99937.59,268767.00
29,30,65605.48,153032.06,107138.38,New York,101004.64,325775.92
28,29,66051.52,182645.56,118148.20,Florida,103282.38,366845.28
27,28,72107.60,127864.55,353183.81,New York,105008.31,553155.96
26,27,75328.87,144135.98,134050.07,Florida,105733.54,353514.92
25,26,64664.71,139553.16,137962.62,California,107404.34,342180.49
24,25,77044.01,99281.34,140574.81,New York,108552.04,316900.16
23,24,67532.53,105751.03,304768.73,Florida,108733.99,478052.29
22,23,73994.56,122782.75,303319.26,Florida,110352.25,500096.57
21,22,78389.47,153773.43,299737.29,New York,111313.02,531900.19
20,21,76253.86,113867.30,298664.47,California,118474.03,488785.63
19,20,86419.70,153514.11,0.00,New York,122776.86,239933.81
18,19,91749.16,114175.79,294919.57,Florida,124266.90,500844.52
17,18,94657.16,145077.58,282574.31,New York,125370.37,522309.05
16,17,78013.11,121597.55,264346.06,California,126992.93,463956.72
15,16,114523.61,122616.84,261776.23,New York,129917.04,498916.68
14,15,119943.24,156547.42,256512.92,Florida,132602.65,533003.58
13,14,91992.39,135495.07,252664.93,California,134307.35,480152.39
12,13,93863.75,127320.38,249839.44,Florida,141585.52,471023.57
11,12,100671.96,91790.61,249744.55,California,144259.40,442207.12
10,11,101913.08,110594.11,229160.95,Florida,146121.95,441668.14
9,10,123334.88,108679.17,304981.62,California,149759.96,536995.67
8,9,120542.52,148718.95,311613.29,New York,152211.77,580874.76
7,8,130298.13,145530.06,323876.68,Florida,155752.60,599704.87
6,7,134615.46,147198.87,127716.82,California,156122.51,409531.15
5,6,131876.90,99814.71,362861.36,New York,156991.12,594552.97
4,5,142107.34,91391.77,366168.42,Florida,166187.94,599667.53
3,4,144372.41,118671.85,383199.62,New York,182901.99,646243.88
2,3,153441.51,101145.55,407934.54,Florida,191050.39,662521.60
1,2,162597.70,151377.59,443898.53,California,191792.06,757873.82
0,1,165349.20,136897.80,471784.10,New York,192261.83,774031.10

In [68]:
# which are the 3 companies that spend the most money on R&D

startup_df.sort_values("R&D Spend", ascending=False).head(3)

,ID,R&D Spend,Administration,Marketing Spend,State,Profit,Total_Spend
0,1,165349.20,136897.80,471784.10,New York,192261.83,774031.10
1,2,162597.70,151377.59,443898.53,California,191792.06,757873.82
2,3,153441.51,101145.55,407934.54,Florida,191050.39,662521.60

In [70]:
# which are the 6 companies that spend the less money on Administration

startup_df.sort_values("Administration", ascending=True).head(6)

,ID,R&D Spend,Administration,Marketing Spend,State,Profit,Total_Spend
37,38,44069.95,51283.14,197029.42,California,89949.14,292382.51
48,49,542.05,51743.15,0.00,New York,35673.41,52285.20
38,39,20229.59,65947.93,185265.10,New York,81229.06,271442.62
39,40,38558.51,82982.09,174999.30,California,81005.76,296539.90
41,42,27892.92,84710.77,164470.71,Florida,77798.83,277074.40
35,36,46014.02,85047.44,205517.64,New York,96479.51,336579.10

In [71]:
# create a new column "ROI" calculated from "Profit" / "Total_Spend" columns

startup_df["ROI"] = startup_df["Profit"] / startup_df["Total_Spend"]

In [73]:
# find out which are the 10 companies that have the highest "ROI" ratio

startup_df.sort_values("ROI", ascending=False).head(10)

,ID,R&D Spend,Administration,Marketing Spend,State,Profit,Total_Spend,ROI
48,49,542.05,51743.15,0.00,New York,35673.41,52285.20,0.682285
19,20,86419.70,153514.11,0.00,New York,122776.86,239933.81,0.511711
45,46,1000.23,124153.04,1903.93,New York,64926.08,127057.20,0.510999
32,33,63408.86,129219.61,46085.25,California,97427.84,238713.72,0.408137
43,44,15505.73,127382.30,35534.17,New York,69758.98,178422.20,0.390977
6,7,134615.46,147198.87,127716.82,California,156122.51,409531.15,0.381223
30,31,61994.48,115641.28,91131.24,Florida,99937.59,268767.00,0.371837
24,25,77044.01,99281.34,140574.81,New York,108552.04,316900.16,0.342543
10,11,101913.08,110594.11,229160.95,Florida,146121.95,441668.14,0.330841
11,12,100671.96,91790.61,249744.55,California,144259.40,442207.12,0.326226

In [75]:
# Calculate the average R&D Spend made from these startups

startup_df["R&D Spend"].mean()

73721.61559999999

In [76]:
# Calculate the max Profit made from these startups

startup_df["R&D Spend"].max()

165349.2

In [79]:
# Calculate the min Administration made from these startups

startup_df["Administration"].min()

51283.14

In [80]:
# Sort the dataset so that only startups with higher R&D Spend than the average R&D Spend are shown

startup_df[startup_df["R&D Spend"] > startup_df["R&D Spend"].mean()]

,ID,R&D Spend,Administration,Marketing Spend,State,Profit,Total_Spend,ROI
0,1,165349.20,136897.80,471784.10,New York,192261.83,774031.10,0.248390
1,2,162597.70,151377.59,443898.53,California,191792.06,757873.82,0.253066
2,3,153441.51,101145.55,407934.54,Florida,191050.39,662521.60,0.288369
3,4,144372.41,118671.85,383199.62,New York,182901.99,646243.88,0.283023
4,5,142107.34,91391.77,366168.42,Florida,166187.94,599667.53,0.277133
5,6,131876.90,99814.71,362861.36,New York,156991.12,594552.97,0.264049
6,7,134615.46,147198.87,127716.82,California,156122.51,409531.15,0.381223
7,8,130298.13,145530.06,323876.68,Florida,155752.60,599704.87,0.259715
8,9,120542.52,148718.95,311613.29,New York,152211.77,580874.76,0.262039
9,10,123334.88,108679.17,304981.62,California,149759.96,536995.67,0.278885
10,11,101913.08,110594.11,229160.95,Florida,146121.95,441668.14,0.330841
11,12,100671.96,91790.61,249744.55,California,144259.40,442207.12,0.326226
12,13,93863.75,127320.38,249839.44,Florida,141585.52,471023.57,0.300591
13,14,91992.39,135495.07,252664.93,California,134307.35,480152.39,0.279718
14,15,119943.24,156547.42,256512.92,Florida,132602.65,533003.58,0.248784
15,16,114523.61,122616.84,261776.23,New York,129917.04,498916.68,0.260398
16,17,78013.11,121597.55,264346.06,California,126992.93,463956.72,0.273717
17,18,94657.16,145077.58,282574.31,New York,125370.37,522309.05,0.240031
18,19,91749.16,114175.79,294919.57,Florida,124266.90,500844.52,0.248115
19,20,86419.70,153514.11,0.00,New York,122776.86,239933.81,0.511711
20,21,76253.86,113867.30,298664.47,California,118474.03,488785.63,0.242384
21,22,78389.47,153773.43,299737.29,New York,111313.02,531900.19,0.209274
22,23,73994.56,122782.75,303319.26,Florida,110352.25,500096.57,0.220662
24,25,77044.01,99281.34,140574.81,New York,108552.04,316900.16,0.342543
26,27,75328.87,144135.98,134050.07,Florida,105733.54,353514.92,0.299092

In [83]:
# Filter the dataset so that only data for the startup with the minimum "Administration" spend are shown

startup_df[startup_df["Administration"] == startup_df["Administration"].min()]

,ID,R&D Spend,Administration,Marketing Spend,State,Profit,Total_Spend,ROI
37,38,44069.95,51283.14,197029.42,California,89949.14,292382.51,0.307642

In [84]:
# Filter the dataset so that only data for the startup with the maximum "R&D Spend" spend are shown

startup_df[startup_df["R&D Spend"] == startup_df["R&D Spend"].max()]

,ID,R&D Spend,Administration,Marketing Spend,State,Profit,Total_Spend,ROI
0,1,165349.2,136897.8,471784.1,New York,192261.83,774031.1,0.24839

In [7]:
# Find out how many startups are located to each different "State"

startup_df["State"].value_counts()

New York      20
California    17
Florida       16
Name: State, dtype: int64

In [6]:
# Get the proportion of states and sort them in descending order

startup_df["State"].value_counts(sort=True, normalize=True)

New York      0.377358
California    0.320755
Florida       0.301887
Name: State, dtype: float64

In [18]:
# Which is the mean Administration spend for each different state?

startup_df.groupby("State")["Administration"].mean()

State
California    120746.507059
Florida       121768.897500
New York      122360.472000
Name: Administration, dtype: float64

In [17]:
# Which is the maximum R&D spend for each different state?

startup_df.groupby("State")["R&D Spend"].max()

State
California    162597.70
Florida       153441.51
New York      165349.20
Name: R&D Spend, dtype: float64

In [19]:
# Which is the min, max and total value of profit for each different state?

startup_df.groupby("State")["Profit"].agg([min, max, sum])

                 min        max         sum
State
California  14681.40  191792.06  1766387.98
Florida     49490.75  191050.39  1900384.39
New York    35673.41  192261.83  2271922.71

In [25]:
startup_df.groupby("State")[["R&D Spend", "Administration", "Marketing Spend"]].mean()

               R&D Spend  Administration  Marketing Spend
State
California  64657.674118   120746.507059    182540.929412
Florida     80724.016250   121768.897500    247323.551250
New York    76054.408000   122360.472000    209450.754500

In [28]:
startup_df.groupby("State")[["R&D Spend", "Administration", "Marketing Spend"]].agg(["mean",sum])

               R&D Spend             Administration              \
                    mean         sum           mean         sum
State
California  64657.674118  1099180.46  120746.507059  2052690.62
Florida     80724.016250  1291584.26  121768.897500  1948302.36
New York    76054.408000  1521088.16  122360.472000  2447209.44

           Marketing Spend
                      mean         sum
State
California   182540.929412  3103195.80
Florida      247323.551250  3957176.82
New York     209450.754500  4189015.09